# IsInterrupted Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DrawContext..::..IsInterrupted Method
DrawContext Class See Also
---
Checks whether the current rendering pass has been interrupted.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static bool IsInterrupted()
```

Visual Basic
---
```text
Public Shared Function IsInterrupted As Boolean
```

Visual C++
---
```text
public:
static bool IsInterrupted()
```

# ### Return Value
True if the current rendering pass has been interrupted before its completion, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer. |

# See Also
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace